app/controllers/users_controller.rb

  def index
    users = User.all
---
SELECT `users`.* FROM `users`

  def show
    begin
      user = User.find_by!(id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 'user1' LIMIT 1

  def update
    begin
      user = User.find_by!(id: params[:id])
      user = user.update!(name: params[:name], email: params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = '67bdc0ca766bb7d29782' LIMIT 1
UPDATE `users` SET `name` = 'eeee', `email` = 'hogehoge@gmail.com', `updated_at` = '2019-07-02 12:05:22' WHERE `users`.`id` = 'user1'