app/controllers/users/tweets_controller.rb

    def index
        begin
            tweets = Tweet.where!(user_id: params[:user_id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 'user1'

    def create
        begin
            tweets = Tweet.create!(id: SecureRandom.hex(10), user_id: params[:user_id], tweet: params[:tweet])
---
INSERT INTO `tweets` (`id`, `user_id`, `tweet`, `created_at`, `updated_at`) VALUES ('81096ccc243926d06de5', 'user1', 'steamsssｓｓｓｓ', '2019-07-01 10:27:12', '2019-07-01 10:27:12')